<?php

namespace App\Blocks;

class NoorBlock
{
    private $quotes = [
        "روي عن رسول الله (صلى الله عليه وآله) أنه قال : « إِنَّ اليَتِيمَ إَذَا بَكَى اهْتزَّ لهُ العَرْش ، فَيَقُولُ الله تبارك وتعالى : مَنْ هَذا الذِّي أَبْكَى عَبْدِيَ الذِّي سَلَبْتُهُ أَبَوَيْهِ فِي صِغَرِهْ ؟ .. فَـ وَعِزَّتِي وَ جَلَالِي لَا يُسْكِتُه أَحَدٌ إِلَّا أَوْجَبْتُ لَهُ الجَنَّة ».",
        "روي عن أمير المؤمنين (عليه السلام) أنه قال : «  يا عبدالله ! , لا تَعجَل في عَيبِ أَحَدٍ بِذَنبِه فَلَعَلهُ مَغفُورٌ لَهُ , وَلا تَأمَن عَلى نَفسِك صَغِيرَ مَعصِيَةٍ فَلَعَلكَ مُعَذب عَلَيه , فَليَكفُف مَن عَلِمَ مِنكُم عَيبَ غَيرِه لِمَا يَعلَم مِن عَيبِ نَفسِه , وَليَكُن الشُكرُ شَاغِلا لَهُ عَلَى مُعَافَاتِه مِما اِبتُلِيَ بِه غَيرُه ».",
        "روي عن الإمام جعفر الصادق (عليه السلام) أنه قال : « إنّ البكاءَ والجزعَ مكروهٌ للعبدِ في كُلِّ ما جَزَعْ مَا خَلا البُكاء والجزع على الحُسينِ بنُ عَلي فإِنّه فِيهِ مَأجُورْ ».",
        "روي عن رسول الله (صلى الله عليه وآله) أنه قال : « بُرُوا آباءكُم يبُرُّكُم أبناؤُكُمْ ».",
        "روي عن رسول الله (صلى الله عليه وآله) أنه قال : « طُوبَى لِمَن تركَ شهوةً حاضرةً لِموْعدٍ لم يَرَهْ ».",
        "روي عن رسول الله (صلى الله عليه وآله) أنه قال : « حُسْنُ الخلقِ يُثبِّتُ الموَدّة ».",
        "روي عن رسول الله (صلى الله عليه وآله) أنه قال : « الجنّةُ دارُ الأسْخِياء ».",
        "روي عن رسول الله (صلى الله عليه وآله) أنه قال : « الدُنْيا سِجْنُ المُؤْمِن , وجنةُ الكافِر ».",
        "روي عن الإمام محمد بن علي الجواد (عليه السلام) أنه قال : « العُلماءُ غُرباءُ لِكثْرةِ الجُهّالِ بينهُم ».",
        "روي عن الإمام علي بن محمد الهادي (عليه السلام) أنه قال : « مَنْ هانَتْ عَليْهِ نفسُهُ فـَلا تأْمَن شرّه ».",
        "روي عن الصديقة الكبرى السيدة فاطمة الزهراء (عليها السلام) أنها قالت : « خيْرٌ للمرْأةِ ألَّا ترى رَجُلاً وألَّا يَراهَا رَجُلْ ».",
        "روي عن الإمام الحسن بن علي (عليه السلام) أنه قال : « عجِبْتُ لِمَن يُفكِّر في مَأكُولِه ، كَيْف لا يُفكِّر في مَعْقُولِه ، فَيُجنِّبُ بطنهُ ما يُؤذِيه ، ويُودِعُ صدْرَهُ ما يُرْدِيه ؟ ».",
        "روي عن الإمام الحسن بن علي (عليه السلام) أنه قال : « رَحِم الله أقْوَامًا كانت الدُّنْيَا عِنْدَهُم وَدِيعَةً، فَأدَّوْهَا إِلى مَنِ اْئْتَمَنَهُمْ عَلَيْهَا، وَلَمْ يُسَلِّمُوا أَنْفُسَهُمْ لَهَا ».",
        "روي عن الإمام الحسين بن علي (عليه السلام) أنه قال : « إنّ أجْوَدَ النّاسِ مَنْ أعْطى مَنْ لا يَرْجُوهُ ».",
        "روي عن الإمام علي بن الحسين السجاد (عليه السلام) أنه قال : « لا يَهلِكُ إلاّ مَنْ وَجَدَ سَبِيلاً إلى مَعْرِفَةِ اللهِ سُبْحانَهُ فَلَمْ يَتَمَسَّكْ بِها ».",
        "روي عن الإمام محمد بن علي الباقر (عليه السلام) أنه قال : « مَنْ عَمِلَ بِما يَعْلَمُ ، عَلَّمَهُ اللهُ ما لا يَعْلَمُ ».",
        "روي عن الإمام موسى بن جعفر الكاظم (عليه السلام) أنه قال : « لَيْسَ مِنّا مَنْ لَمْ يُحاسِبْ نَفْسَهُ في كُلِّ يَوْمٍ ».",
        "روي عن الإمام علي بن موسى الرضا (عليه السلام) أنه قال : « مَنْ لَمْ يَشْكُرِ المُنْعِمَ مِنَ المَخْلُوقِينَ لَمْ يَشْكُرِ اللهَ عَزَّ وَجَلَّ ».",
        "روي عن الإمام الحسن بن علي العسكري (عليه السلام) أنه قال : « لَيْسَتِ العِبادَةُ كَثْرَةَ الصِّيامِ وَالصَّلاةِ ، وَإنَّما العِبادَةُ كَثْرَةُ التَّفَكُّرِ في أمْرِ اللهِ ».",
        "روي عن الإمام المهدي المنتظر (عجل الله فرجه الشريف) أنه قال : « أنا خاتم الأوصياء ، وبي يدفع الله البلاء عن أهلي وشيعتي »."
    ];

    public function getRandomQuote()
    {
        return $this->quotes[array_rand($this->quotes)];
    }
}
